reddit/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "pnav"], ["session_token", "93fdB5YX2lyvOTKa8OrzNg"], ["password_digest", "$2a$12$MyQAJwezP3xUJjmsWZ8CxOX1VJpGVPDhRsSlJoB.sXEVppMDdxPSu"]]
---
    def create
        @user = User.new(user_params)

        if @user.save